src/Enums/ТипыСерверов/ТипыСерверов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСерверов</name>
  <enumValues>
    <name>Кластер1С</name>
  </enumValues>
  <enumValues>
    <name>СУБД</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Серверы/Серверы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Серверы</name>
  <attributes>
    <name>ТипСервера</name>
    <type>
      <types>EnumRef.ТипыСерверов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСУБД</name>
    <type>
      <types>EnumRef.ТипыСУБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/Серверы/Module.bsl
Функция ПолучитьЭлемент(Наименование, ТипСервера) Экспорт
	
	Ссылка = НайтиЭлемент(Наименование, ТипСервера);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(Наименование, ТипСервера);
	КонецЕсли;
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(Наименование, ТипСервера) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Серверы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Серверы КАК Серверы
		|ГДЕ
		|	Серверы.Наименование = &Наименование
		|	И Серверы.ТипСервера = &ТипСервера
		|	И НЕ Серверы.ПометкаУдаления"; 
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ТипСервера", ТипСервера);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Серверы.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(Наименование, ТипСервера) Экспорт
	
	СерверОбъект = Справочники.Серверы.СоздатьЭлемент();
	СерверОбъект.Наименование = Наименование;
	СерверОбъект.ТипСервера = ТипСервера;
	СерверОбъект.Порт = ПортПоУмолчанию(ТипСервера);
	СерверОбъект.Записать();
	
	Возврат СерверОбъект.Ссылка;
	
КонецФункции


Функция ПроверитьПорт(Порт) Экспорт
	
	Если Порт < 1 Или Порт > 65535 Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции 

Функция ПортПоУмолчанию(ТипСервера) Экспорт
	
	Если ТипСервера = Перечисления.ТипыСерверов.Кластер1С Тогда
		Возврат 1541;
	КонецЕсли;
	Возврат 1;
	
КонецФункции
